import pandas as pd


### 建立生活消費資料
data = {
    "交易編號": [
        "T001", "T002", "T003", "T004",
        "T005", "T006", "T007", "T008",
        "T009", "T010"
    ],
    "類別": [
        "餐飲", "交通", "餐飲", "娛樂",
        "交通", "餐飲", "娛樂", "交通",
        "餐飲", "娛樂"
    ],
    "付款方式": [
        "現金", "悠遊卡", "信用卡", "信用卡",
        "悠遊卡", "現金", "信用卡", "悠遊卡",
        "信用卡", "現金"
    ],
    "金額": [
        120, 50, 280, 450,
        35, 90, 600, 60,
        200, 300
    ]
}

df = pd.DataFrame(data)

### 找出各類別最低單筆消費
result = df.groupby("類別")["金額"].min()

print(result)